In [40]:
# import libraries
import pandas as pd
import seaborn as sns
import matplotlib as plt
import numpy as np

Formatting and Cleaning

In [41]:
#cleaning
demo = pd.read_csv('base_dfs/df_final_demo.csv')
demo

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth
0,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0
1,2304905,7.0,94.0,58.0,U,2.0,110860.30,6.0,9.0
2,1439522,5.0,64.0,32.0,U,2.0,52467.79,6.0,9.0
3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0
4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0
...,...,...,...,...,...,...,...,...,...
70604,7993686,4.0,56.0,38.5,U,3.0,1411062.68,5.0,5.0
70605,8981690,12.0,148.0,31.0,M,2.0,101867.07,6.0,6.0
70606,333913,16.0,198.0,61.5,F,2.0,40745.00,3.0,3.0
70607,1573142,21.0,255.0,68.0,M,3.0,475114.69,4.0,4.0
70608,5602139,21.0,254.0,59.5,F,3.0,157498.73,7.0,7.0

In [42]:
# visualize nulls 
demo.isna().sum()

client_id            0
clnt_tenure_yr      14
clnt_tenure_mnth    14
clnt_age            15
gendr               14
num_accts           14
bal                 14
calls_6_mnth        14
logons_6_mnth       14
dtype: int64

In [43]:
# Rows with null values
demo.loc[demo["clnt_age"].isna()]

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth
4164,7402828,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8316,355337,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8677,8412164,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9583,4666211,8.0,106.0,NaN,F,2.0,42550.55,4.0,7.0
13444,2222915,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
18066,4876926,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25961,5277910,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
28432,7616759,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
35323,8191345,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
43518,1227228,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
46076,8611797,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
47189,5144725,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
49846,1037867,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
63701,1618749,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
66219,6021001,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [44]:
# find the client_id that are missing all values
nullRows = demo.loc[demo['bal'].isna()]['client_id'].values

In [45]:
# drop row with null values
demo.dropna(thresh=7, inplace=True)

In [46]:
# cleaning column names and fill null value in age, replace X to U (unknown)
demo.rename(columns={'gendr': 'gender'}, inplace=True)
demo.rename(columns= {'clnt_tenure_yr':'tenure_years'}, inplace = True)
demo.rename(columns= {'clnt_tenure_mnth':'tenure_month'}, inplace = True)
demo.rename(columns= {'clnt_age':'age'}, inplace = True)
demo.rename(columns= {'gendr':'gender'}, inplace = True)
demo.rename(columns= {'calls_6_mnth':'calls'}, inplace = True)
demo.rename(columns= {'logons_6_mnth':'logons'}, inplace = True)
demo['age'].fillna(round(demo['age'].mean()), inplace=True)
demo['gender'].replace({'X': 'U'}, inplace=True)

In [47]:
#cleaning group_type
group_type = pd.read_csv('base_dfs/df_final_experiment_clients.csv')
group_type

       client_id Variation
0        9988021      Test
1        8320017      Test
2        4033851   Control
3        1982004      Test
4        9294070   Control
...          ...       ...
70604    2443347       NaN
70605    8788427       NaN
70606     266828       NaN
70607    1266421       NaN
70608    9895983       NaN

[70609 rows x 2 columns]

In [48]:
# amount of NaN
group_type.isna().sum()

client_id        0
Variation    20109
dtype: int64

In [49]:
# function to find the index of the client ids that was null in demo
def indexfinder(values, df):
    indexer = []

    for value in values:
        i = df.loc[df['client_id'] == value].index
        indexer.append(i)

    return [x[0] for x in indexer]

list(nullRows)

[7402828,
 355337,
 8412164,
 2222915,
 4876926,
 5277910,
 7616759,
 8191345,
 1227228,
 8611797,
 5144725,
 1037867,
 1618749,
 6021001]

In [50]:
# changing name of the column, fill all NaN and droping the client ids with null values of the demo
group_type.rename(columns={'Variation': 'group_type'}, inplace=True)
group_type.drop(indexfinder(nullRows, group_type), inplace=True)
group_type.fillna('Unknow', inplace=True)

In [51]:
#group_type.head()

In [52]:
#cleaning data 1
data1 = pd.read_csv('base_dfs\df_final_web_data_pt_1.csv')
data1

,client_id,visitor_id,visit_id,process_step,date_time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04
...,...,...,...,...,...
343136,2443347,465784886_73090545671,136329900_10529659391_316129,confirm,2017-03-31 15:15:46
343137,2443347,465784886_73090545671,136329900_10529659391_316129,step_3,2017-03-31 15:14:53
343138,2443347,465784886_73090545671,136329900_10529659391_316129,step_2,2017-03-31 15:12:08
343139,2443347,465784886_73090545671,136329900_10529659391_316129,step_1,2017-03-31 15:11:37
343140,2443347,465784886_73090545671,136329900_10529659391_316129,start,2017-03-31 15:10:47

In [53]:
#cleaning data 2
data2 = pd.read_csv('base_dfs\df_final_web_data_pt_2.csv')
data2

,client_id,visitor_id,visit_id,process_step,date_time
0,763412,601952081_10457207388,397475557_40440946728_419634,confirm,2017-06-06 08:56:00
1,6019349,442094451_91531546617,154620534_35331068705_522317,confirm,2017-06-01 11:59:27
2,6019349,442094451_91531546617,154620534_35331068705_522317,step_3,2017-06-01 11:58:48
3,6019349,442094451_91531546617,154620534_35331068705_522317,step_2,2017-06-01 11:58:08
4,6019349,442094451_91531546617,154620534_35331068705_522317,step_1,2017-06-01 11:57:58
...,...,...,...,...,...
412259,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:46:10
412260,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:45:29
412261,9668240,388766751_9038881013,922267647_3096648104_968866,step_1,2017-05-24 18:44:51
412262,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:44:34
412263,674799,947159805_81558194550,86152093_47511127657_716022,start,2017-06-03 12:17:09

In [54]:
# CONCATENATING THE 2 PARTS OF THE "DIGITAL FOOTPRINTS"
webdata = pd.concat([data1, data2], axis=0).reset_index(drop=True)
webdata.head()

,client_id,visitor_id,visit_id,process_step,date_time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04

In [55]:
webdata.dtypes

client_id        int64
visitor_id      object
visit_id        object
process_step    object
date_time       object
dtype: object

In [56]:
# drop duplicates and the client ids with null values on demo
webdata.drop_duplicates(inplace=True)
webdata.drop(indexfinder(nullRows, webdata), inplace=True)

In [57]:
# formatting date time
webdata['date_time'] = pd.to_datetime(webdata['date_time'])

In [58]:
# filtering to client ids on demo
unique_client_id= demo["client_id"].to_list()
webdata2 = webdata.loc[webdata["client_id"].isin(unique_client_id)]
webdata2
webdata2['client_id'].nunique()

70595

Import to SQL

In [59]:
import mysql.connector
from getpass import getpass
from sqlalchemy import create_engine

In [61]:
# get connected to the sql 

host= '127.0.0.1'
pw= getpass()
user= 'root'

conn = mysql.connector.connect(host= host, user= user, password= pw)

In [62]:
#now are creating a cursor, that will hold our query, execute it, and fetch results

cursor = conn.cursor()

In [63]:
# querying the database to sql

query = """CREATE DATABASE IF NOT EXISTS project;"""

cursor.execute(query)

query1 = "SHOW DATABASES"
cursor.execute(query1)
cursor.fetchall()

[('bank',),
 ('coffeeshop',),
 ('dealership',),
 ('gold',),
 ('information_schema',),
 ('iris',),
 ('mysql',),
 ('performance_schema',),
 ('project',),
 ('sakila',),
 ('students',),
 ('sys',),
 ('website',),
 ('world',)]

In [64]:
#sending to sql
eng3 = create_engine(f'mysql+pymysql://{user}:{pw}@{host}/project')
webdata.to_sql('webdata', con= eng3)

744627

In [65]:
#sending to sql
eng2 = create_engine(f'mysql+pymysql://{user}:{pw}@{host}/project')
group_type.to_sql('group_type', con= eng2)

70595

In [66]:
#sending to sql
eng = create_engine(f'mysql+pymysql://{user}:{pw}@{host}/project')
demo.to_sql('demo', con= eng)

70595